Rahix/avr-device/vendor/atmega164pa.atdf
        <module name="TC8">
          <instance name="TC0" caption="Timer/Counter, 8-bit">
            <register-group name="TC0" name-in-module="TC0" offset="0x00" address-space="data" caption="Timer/Counter, 8-bit"/>
            <signals>
              <signal group="T" function="default" pad="PB0"/>
              <signal group="OCB" function="default" pad="PB4"/>
              <signal group="OCA" function="default" pad="PB3"/>
            </signals>
          </instance>
        </module>
        <module name="TC8_ASYNC">
          <instance name="TC2" caption="Timer/Counter, 8-bit Async">
            <register-group name="TC2" name-in-module="TC2" offset="0x00" address-space="data" caption="Timer/Counter, 8-bit Async"/>
            <signals>
              <signal group="TOSC" index="1" function="default" pad="PC6"/>
              <signal group="TOSC" index="2" function="default" pad="PC7"/>
              <signal group="OCA" function="default" pad="PD7"/>
              <signal group="OCB" function="default" pad="PD6"/>
            </signals>
          </instance>
        </module>
        <module name="WDT">
          <instance name="WDT" caption="Watchdog Timer">
            <register-group name="WDT" name-in-module="WDT" offset="0x00" address-space="data" caption="Watchdog Timer"/>
          </instance>
        </module>
        <module name="JTAG">
          <instance name="JTAG" caption="JTAG Interface">
            <register-group name="JTAG" name-in-module="JTAG" offset="0x00" address-space="data" caption="JTAG Interface"/>
            <signals>
              <signal group="TCK" function="default" pad="PC2"/>
              <signal group="TMS" function="default" pad="PC3"/>
              <signal group="TDO" function="default" pad="PC4"/>
              <signal group="TDI" function="default" pad="PC5"/>
            </signals>
          </instance>
        </module>
        <module name="BOOT_LOAD">
          <instance name="BOOT_LOAD" caption="Bootloader">
            <register-group name="BOOT_LOAD" name-in-module="BOOT_LOAD" offset="0x00" address-space="data" caption="Bootloader"/>
          </instance>
        </module>
        <module name="EXINT">
          <instance name="EXINT" caption="External Interrupts">
            <register-group name="EXINT" name-in-module="EXINT" offset="0x00" address-space="data" caption="External Interrupts"/>
            <signals>
              <signal group="PCINT" index="0" function="default" pad="PA0"/>
              <signal group="PCINT" index="1" function="default" pad="PA1"/>
              <signal group="PCINT" index="2" function="default" pad="PA2"/>
              <signal group="PCINT" index="3" function="default" pad="PA3"/>
              <signal group="PCINT" index="4" function="default" pad="PA4"/>
              <signal group="PCINT" index="5" function="default" pad="PA5"/>
              <signal group="PCINT" index="6" function="default" pad="PA6"/>
              <signal group="PCINT" index="7" function="default" pad="PA7"/>
              <signal group="PCINT" index="8" function="default" pad="PB0"/>
              <signal group="PCINT" index="9" function="default" pad="PB1"/>
              <signal group="PCINT" index="10" function="default" pad="PB2"/>
              <signal group="PCINT" index="11" function="default" pad="PB3"/>
              <signal group="PCINT" index="12" function="default" pad="PB4"/>
              <signal group="PCINT" index="13" function="default" pad="PB5"/>
              <signal group="PCINT" index="14" function="default" pad="PB6"/>
              <signal group="PCINT" index="15" function="default" pad="PB7"/>
              <signal group="PCINT" index="16" function="default" pad="PC0"/>
              <signal group="PCINT" index="17" function="default" pad="PC1"/>
              <signal group="PCINT" index="18" function="default" pad="PC2"/>
              <signal group="PCINT" index="19" function="default" pad="PC3"/>
              <signal group="PCINT" index="20" function="default" pad="PC4"/>
              <signal group="PCINT" index="21" function="default" pad="PC5"/>
              <signal group="PCINT" index="22" function="default" pad="PC6"/>
              <signal group="PCINT" index="23" function="default" pad="PC7"/>
              <signal group="PCINT" index="24" function="default" pad="PD0"/>
              <signal group="PCINT" index="25" function="default" pad="PD1"/>
              <signal group="PCINT" index="26" function="default" pad="PD2"/>
              <signal group="PCINT" index="27" function="default" pad="PD3"/>
              <signal group="PCINT" index="28" function="default" pad="PD4"/>
              <signal group="PCINT" index="29" function="default" pad="PD5"/>
              <signal group="PCINT" index="30" function="default" pad="PD6"/>
              <signal group="PCINT" index="31" function="default" pad="PD7"/>
              <signal group="INT" index="0" function="default" pad="PD2"/>
              <signal group="INT" index="1" function="default" pad="PD3"/>
              <signal group="INT" index="2" function="default" pad="PB2"/>
            </signals>
          </instance>
        </module>
        <module name="ADC">
          <instance name="ADC" caption="Analog-to-Digital Converter">
            <register-group name="ADC" name-in-module="ADC" offset="0x00" address-space="data" caption="Analog-to-Digital Converter"/>
            <signals>
              <signal group="ADC" index="0" function="default" pad="PA0"/>
              <signal group="ADC" index="1" function="default" pad="PA1"/>
              <signal group="ADC" index="2" function="default" pad="PA2"/>
              <signal group="ADC" index="3" function="default" pad="PA3"/>
              <signal group="ADC" index="4" function="default" pad="PA4"/>
              <signal group="ADC" index="5" function="default" pad="PA5"/>
              <signal group="ADC" index="6" function="default" pad="PA6"/>
              <signal group="ADC" index="7" function="default" pad="PA7"/>
            </signals>
          </instance>
        </module>
        <module name="TC16">
          <instance name="TC1" caption="Timer/Counter, 16-bit">
            <register-group name="TC1" name-in-module="TC1" offset="0x00" address-space="data" caption="Timer/Counter, 16-bit"/>
            <signals>
              <signal group="T" function="default" pad="PB1"/>
              <signal group="ICP" function="default" pad="PD6"/>
              <signal group="OCA" function="default" pad="PD5"/>
              <signal group="OCB" function="default" pad="PD4"/>
            </signals>
          </instance>
        </module>
        <module name="EEPROM">
          <instance name="EEPROM" caption="EEPROM">
            <register-group name="EEPROM" name-in-module="EEPROM" offset="0x00" address-space="data" caption="EEPROM"/>
